letssteam/codal-stm32-STEAM32_WB55RG/samples/Demo/demo_sample.cpp
#include "demo_sample.h"

using namespace codal;
using namespace std;

#include <algorithm>
#include <cmath>
#include <functional>
#include <string>
#include <vector>

#include "APDS9960.h"
#include "BQ27441.h"
#include "HTS221.h"
#include "STM32Pin.h"
#include "STM32RTC.h"
#include "STM32SAI.h"
#include "STM32SingleWireSerial.h"
#include "VL53L1X.h"
#include "WSEN-PADS.h"
#include "daplink_flash.h"
#include "ism330dl.h"
#include "lis2mdl.h"
#include "mcp23009-e.h"
#include "menu.h"
#include "pcm_utils.h"
#include "pdm2pcm.h"
#include "ssd1327.h"

constexpr uint16_t AUDIO_BUFFER = 256;

constexpr uint8_t MCP_GPIO_1    = 0;
constexpr uint8_t MCP_GPIO_2    = 1;
constexpr uint8_t MCP_GPIO_3    = 2;
constexpr uint8_t MCP_GPIO_4    = 3;
constexpr uint8_t MCP_GP_RIGHT  = 4;
constexpr uint8_t MCP_GP_BOTTOM = 5;
constexpr uint8_t MCP_GP_LEFT   = 6;
constexpr uint8_t MCP_GP_UP     = 7;

STM32I2C* i2c_qwiic = nullptr;
STM32SPI* spi       = nullptr;
STM32Pin* cs        = nullptr;
STM32Pin* dc        = nullptr;
STM32Pin* rst       = nullptr;
STM32Pin* led_red   = nullptr;
STM32Pin* led_green = nullptr;
STM32Pin* led_blue  = nullptr;
SSD1327_SPI* ssd    = nullptr;

STM32Pin* btnMenu = nullptr;
STM32Pin* btnA    = nullptr;
STM32Pin* btnB    = nullptr;
STM32Pin* buzzer  = nullptr;

BQ27441* battery = nullptr;
MCP23009E* mcp   = nullptr;
HTS221* hts      = nullptr;
WSEN_PADS* pres  = nullptr;
VL53L1X* tof     = nullptr;
STM32SAI* sai    = nullptr;
PDM2PCM pdm2pcm(16, 8, 0, 1);

APDS9960* apds = nullptr;
ISM330DL* ism  = nullptr;
LIS2MDL* lis   = nullptr;
STM32SingleWireSerial* jacdac;
DaplinkFlash* flash;

STM32RTC* rtc = nullptr;

ScreenMenu* mainMenu = nullptr;

STM32Pin* microbit_pins[19]           = {nullptr};
STM32Pin* microbit_pwm_pins[3]        = {nullptr};
STM32Pin* microbit_analog_pad_pins[3] = {nullptr};

uint16_t rawMicData[AUDIO_BUFFER];
bool processedMicData = true;

string fToStr(float value, unsigned pres)
{
    int ent = (int)value;
    int dec = (int)((value - ent) * pow(10, pres));

    return to_string(ent) + "." + to_string(abs(dec));
}

bool click_button(STM32Pin* btn)
{
    if (btn->getDigitalValue() == 0) {
        while (btn->getDigitalValue() == 0)
            ;

        return true;
    }

    return false;
}

void show_main_menu()
{
    mcp->interruptOnFalling(MCP_GP_BOTTOM, []() { mainMenu->moveDown(); });
    mcp->interruptOnFalling(MCP_GP_UP, []() { mainMenu->moveUp(); });

    mainMenu->show();

    while (1) {
        if (btnA->getDigitalValue() == 0) {
            while (btnA->getDigitalValue() == 0)
                ;
            break;
        }

        fiber_sleep(1);
    }

    mcp->disableInterrupt(MCP_GP_BOTTOM);
    mcp->disableInterrupt(MCP_GP_UP);
    mainMenu->execute();
}

void show_temp_hum()
{
    while (1) {
        fiber_sleep(125);

        if (click_button(btnMenu)) {
            break;
        }

        if (!hts->isTemperatureDataAvailable() || !hts->isHumidityDataAvailable()) {
            printf("HTS221 not ready\r\n");
            continue;
        }

        ssd->fill(0x00);
        ssd->drawText("Temperature: " + fToStr(hts->getTemperature(), 2) + " C", 5, 55, 0xFF);
        ssd->drawText("Humidite: " + fToStr(hts->getHumidity(), 2) + " %HR", 5, 65, 0xFF);

        ssd->show();
    }
}

void show_pressure()
{
    while (1) {
        fiber_sleep(125);

        if (click_button(btnMenu)) {
            break;
        }

        ssd->fill(0x00);
        ssd->drawText("Pression: " + fToStr(pres->getPressure(), 2) + " kPa", 5, 55, 0xFF);
        ssd->drawText("Temperature: " + fToStr(pres->getTemperature(), 2) + " C", 5, 65, 0xFF);

        ssd->show();
    }
}

void show_tof()
{
    while (1) {
        fiber_sleep(100);

        if (click_button(btnMenu)) {
            break;
        }

        ssd->fill(0x00);
        ssd->drawText("Distance: " + fToStr(tof->getDistance(), 2) + " mm", 5, 60, 0xFF);
        ssd->show();
    }
}

void show_acc_gyro_magn()
{
    int8_t selection = 0;

    while (1) {
        if (click_button(btnMenu)) {
            break;
        }

        if (mcp->getLevel(MCP_GP_LEFT) == MCP_LOGIC_LEVEL::LOW) {
            while (mcp->getLevel(MCP_GP_LEFT) == MCP_LOGIC_LEVEL::LOW)
                ;

            selection--;
        }

        if (mcp->getLevel(MCP_GP_RIGHT) == MCP_LOGIC_LEVEL::LOW) {
            while (mcp->getLevel(MCP_GP_RIGHT) == MCP_LOGIC_LEVEL::LOW)
                ;

            selection++;
        }

        ssd->fill(0x00);

        if (selection == 0) {
            ssd->drawText("Accelerometer", 25, 20, 0xFF);
            auto accel = ism->readAccelerometerData();

            ssd->drawText("X: " + fToStr(accel.x, 2), 20, 49, 0xFF);
            ssd->drawText("Y: " + fToStr(accel.y, 2), 20, 58, 0xFF);
            ssd->drawText("Z: " + fToStr(accel.z, 2), 20, 67, 0xFF);

            ssd->drawText("<- Magneto", 20, 87, 0xFF);
            ssd->drawText("-> Gyro", 20, 96, 0xFF);
        }
        else if (selection == 1) {
            ssd->drawText("Gyroscope", 30, 20, 0xFF);
            auto gyro = ism->readGyroscopeData();

            ssd->drawText("X: " + fToStr(gyro.x, 2), 20, 49, 0xFF);
            ssd->drawText("Y: " + fToStr(gyro.y, 2), 20, 58, 0xFF);
            ssd->drawText("Z: " + fToStr(gyro.z, 2), 20, 67, 0xFF);

            ssd->drawText("<- Accelero", 20, 87, 0xFF);
            ssd->drawText("-> Magneto", 20, 96, 0xFF);
        }
        else if (selection == 2) {
            ssd->drawText("Magnetometer", 25, 20, 0xFF);

            auto magn = lis->readData();

            ssd->drawText("X: " + fToStr(magn.x, 2), 20, 49, 0xFF);
            ssd->drawText("Y: " + fToStr(magn.y, 2), 20, 58, 0xFF);
            ssd->drawText("Z: " + fToStr(magn.z, 2), 20, 67, 0xFF);

            ssd->drawText("<- Gyro", 20, 87, 0xFF);
            ssd->drawText("-> Accelero", 20, 96, 0xFF);
        }
        else {
            selection = selection < 0 ? 2 : 0;
            continue;
        }

        ssd->show();
        fiber_sleep(125);
    }
}

void show_optical_sensor()
{
    while (1) {
        fiber_sleep(100);

        if (click_button(btnMenu)) {
            break;
        }

        std::array<uint16_t, 4> color_data = apds->getColors();

        ssd->fill(0x00);
        ssd->drawText("Color Sensor", 25, 20, 0xFF);
        ssd->drawText("(untested)", 25, 28, 0xFF);
        ssd->drawText("Red  : " + to_string(color_data[0]), 20, 49, 0xFF);
        ssd->drawText("Green: " + to_string(color_data[1]), 20, 58, 0xFF);
        ssd->drawText("Blue : " + to_string(color_data[2]), 20, 67, 0xFF);
        ssd->drawText("Clear: " + to_string(color_data[3]), 20, 76, 0xFF);
        ssd->show();
    }
}

