letssteam/codal-stm32-STEAM32_WB55RG/samples/Demo/demo_sample.cpp
void show_microphone()
{
    sai->startListening();

    while (1) {
        fiber_sleep(100);

        if (click_button(btnMenu)) {
            break;
        }

        if (!processedMicData) {
            auto conv = pdm2pcm.convert(rawMicData, AUDIO_BUFFER);

            float avg = 0;
            for (auto v : conv) {
                avg += float(v) / float(conv.size());
            }

            ssd->fill(0x00);
            ssd->drawText("Decibel: " + fToStr(PCMUtils::toDecibel(conv), 1) + "dB", 5, 60, 0xFF);
            ssd->show();

            processedMicData = true;
        }
    }

    sai->stopListening();
}

void micro_on_data(const int32_t* data)
{
    if (processedMicData) {
        for (uint16_t i = 0; i < AUDIO_BUFFER; ++i) {
            rawMicData[i] = uint16_t(data[i] & 0x0000FFFF);
        }

        processedMicData = false;
    }
}

void show_buzzer()
{
    uint8_t* cursor = new uint8_t(2);
    int* freq       = new int(440);

    mcp->interruptOnFalling(MCP_GP_BOTTOM, [=]() {
        int p     = pow(10, *cursor);
        int digit = int(*freq / p) % 10;
        if (digit == 0) {
            return;
        }

        *freq -= p;
        buzzer->setAnalogPeriodUs(1000000 / *freq);
        buzzer->setAnalogValue(255);
    });

    mcp->interruptOnFalling(MCP_GP_UP, [=]() {
        int p     = pow(10, *cursor);
        int digit = int(*freq / p) % 10;
        if (digit == 9) {
            return;
        }

        *freq += p;
        buzzer->setAnalogPeriodUs(1000000 / *freq);
        buzzer->setAnalogValue(255);
    });

    mcp->interruptOnFalling(MCP_GP_LEFT, [=]() {
        if (*cursor < 5) {
            (*cursor)++;
        }
    });

    mcp->interruptOnFalling(MCP_GP_RIGHT, [=]() {
        if (*cursor > 0) {
            (*cursor)--;
        }
    });

    buzzer->setAnalogPeriodUs(1000000 / *freq);
    buzzer->setAnalogValue(255);

    while (1) {
        if (click_button(btnMenu)) {
            break;
        }

        auto freqStr     = std::to_string(*freq);
        string cursorStr = "      ";

        while (freqStr.size() < 5) {
            freqStr = "0" + freqStr;
        }

        for (int8_t i = 4; i >= 0; --i) {
            if (i == *cursor) {
                cursorStr.push_back('^');
            }
            else {
                cursorStr.push_back(' ');
            }
        }

        ssd->fill(0x00);
        ssd->drawText("Freq: " + freqStr + "Hz", 15, 40, 0xFF);
        ssd->drawText(cursorStr, 15, 48, 0xFF);
        ssd->drawText("< / >: change digit", 5, 66, 0xFF);
        ssd->drawText("^ / v: de/increase", 5, 75, 0xFF);
        ssd->show();

        fiber_sleep(100);
    }

    buzzer->setAnalogValue(0);
    mcp->disableInterrupt(MCP_GP_BOTTOM);
    mcp->disableInterrupt(MCP_GP_UP);
    delete cursor;
    delete freq;
}

const char* weekdayToStr(uint8_t wd)
{
    switch (wd) {
        case 1:
            return "Monday";
        case 2:
            return "Tuesday";
        case 3:
            return "Wednesday";
        case 4:
            return "Thursday";
        case 5:
            return "Friday";
        case 6:
            return "Saturday";
        case 7:
            return "Sunday";
        default:
            return "???";
    }
}

void inc_limit(uint8_t* value, uint8_t min, uint8_t max)
{
    if (*value == max) {
        *value = min;
    }
    else {
        (*value)++;
    }
}

void dec_limit(uint8_t* value, uint8_t min, uint8_t max)
{
    if (*value == min) {
        *value = max;
    }
    else {
        (*value)--;
    }
}

void show_rtc()
{
    uint8_t* page         = new uint8_t{0};
    uint8_t* weekday      = new uint8_t{0};
    uint8_t* day          = new uint8_t{0};
    uint8_t* month        = new uint8_t{0};
    uint8_t* year         = new uint8_t{0};
    uint8_t* hours        = new uint8_t{0};
    uint8_t* minutes      = new uint8_t{0};
    uint8_t* seconds      = new uint8_t{0};
    bool* isInSettingMode = new bool{false};
    char time_str[20]     = {0};
    char date_str[20]     = {0};
    char setting_str[20]  = {0};

    RTC_Date date;
    RTC_Time time;

    mcp->interruptOnFalling(MCP_GP_BOTTOM, [=]() {
        if (!isInSettingMode) return;

        switch (*page) {
            case 0:
                dec_limit(weekday, 1, 7);
                break;

            case 1:
                dec_limit(day, 1, 31);
                break;

            case 2:
                dec_limit(month, 1, 12);
                break;

            case 3:
                dec_limit(year, 0, 99);
                break;

            case 4:
                dec_limit(hours, 0, 23);
                break;

            case 5:
                dec_limit(minutes, 0, 59);
                break;

            case 6:
                dec_limit(seconds, 0, 59);
                break;

            default:
                break;
        }
    });

    mcp->interruptOnFalling(MCP_GP_UP, [=]() {
        if (!isInSettingMode) return;

        switch (*page) {
            case 0:
                inc_limit(weekday, 1, 7);
                break;

            case 1:
                inc_limit(day, 1, 31);
                break;

            case 2:
                inc_limit(month, 1, 12);
                break;

            case 3:
                inc_limit(year, 0, 99);
                break;

            case 4:
                inc_limit(hours, 1, 23);
                break;

            case 5:
                inc_limit(minutes, 0, 59);
                break;

            case 6:
                inc_limit(seconds, 0, 59);
                break;

            default:
                break;
        }
    });

    mcp->interruptOnFalling(MCP_GP_LEFT, [=]() { dec_limit(page, 0, 6); });

    mcp->interruptOnFalling(MCP_GP_RIGHT, [=]() { inc_limit(page, 0, 6); });

    while (1) {
        if (click_button(btnMenu)) {
            break;
        }

        if (*isInSettingMode) {
            ssd->fill(0x00);

            switch (*page) {
                case 0:
                    sprintf(setting_str, "   %s", weekdayToStr(*weekday));
                    break;

                case 1:
                    sprintf(setting_str, "  Day: %02u", *day);
                    break;

