letssteam/codal-stm32-STEAM32_WB55RG/samples/Demo/demo_sample.cpp
    mcp->interruptOnFalling(MCP_GP_BOTTOM, [=]() {
        *pin_id = ((*pin_id) == 2) ? 0 : (*pin_id) + 1;

        if (*pin_id == 0) {
            microbit_pwm_pins[2]->setAnalogValue(0);
        }
        else {
            microbit_pwm_pins[(*pin_id) - 1]->setAnalogValue(0);
        }

        (*pwm_value) = 0;
    });

    mcp->interruptOnFalling(MCP_GP_UP, [=]() {
        *pin_id = ((*pin_id) == 0) ? 2 : (*pin_id) - 1;

        if (*pin_id == 2) {
            microbit_pwm_pins[0]->setAnalogValue(0);
        }
        else {
            microbit_pwm_pins[(*pin_id) + 1]->setAnalogValue(0);
        }

        (*pwm_value) = 0;
    });

    for (int i = 0; i < 19; ++i) {
        microbit_pins[i]->setDigitalValue(0);
    }

    fiber_sleep(500);

    for (uint8_t i = 0; i < 3; ++i) {
        printf("Init PWM pin #%u (result: %d)\n", i, microbit_pwm_pins[i]->setAnalogValue(0));
    }

    while (1) {
        if (click_button(btnMenu)) {
            break;
        }

        if (getCurrentMillis() - start_timeout >= 100) {
            (*pwm_value) += pwm_step;

            if (*pwm_value >= 1024) {
                *pwm_value = 0;
            }

            microbit_pwm_pins[*pin_id]->setAnalogValue(*pwm_value);

            ssd->fill(0x00);
            ssd->drawText("Pin: 0" + to_string(*pin_id), 42, 36, 0xFF);
            ssd->drawText(string("PWM value:") + ((*pwm_value < 1000) ? "0" : "") + ((*pwm_value < 100) ? "0" : "") +
                              ((*pwm_value < 10) ? "0" : "") + to_string(*pwm_value),
                          20, 52, 0xFF);
            ssd->drawText("Up: Prev. pin", 28, 84, 0xFF);
            ssd->drawText("Down: Next pin", 24, 97, 0xFF);
            ssd->show();

            start_timeout = getCurrentMillis();
        }

        fiber_sleep(1);
    }

    for (int i = 0; i < 19; ++i) {
        microbit_pins[i]->setDigitalValue(0);
    }

    btnA->getDigitalValue();
    btnB->getDigitalValue();
}

void show_analog_microbit()
{
    constexpr uint16_t bar_size = 100 - 14;
    uint32_t start_timeout      = 0;

    for (uint8_t i = 0; i < 3; i++) {
        microbit_analog_pad_pins[i]->getAnalogValue();
    }

    while (1) {
        if (click_button(btnMenu)) {
            break;
        }

        if (getCurrentMillis() - start_timeout > 50) {
            uint16_t height_bar_p0 = (float(microbit_analog_pad_pins[0]->getAnalogValue()) / 1024.0) * bar_size;
            // uint16_t height_bar_p1 = (float(microbit_analog_pad_pins[1]->getAnalogValue()) / 1024.0) * bar_size;
            uint16_t height_bar_p2 = (float(microbit_analog_pad_pins[2]->getAnalogValue()) / 1024.0) * bar_size;

            printf("P0 %i/1024 => %f => %u\n", microbit_analog_pad_pins[0]->getAnalogValue(),
                   (float(microbit_analog_pad_pins[0]->getAnalogValue()) / 1024.0), height_bar_p0);
            // printf("P1 %i/1024 => %f => %u\n", microbit_analog_pad_pins[0]->getAnalogValue(),
            //        (float(microbit_analog_pad_pins[1]->getAnalogValue()) / 1024.0), height_bar_p1);
            printf("P2 %i/1024 => %f => %u\n", microbit_analog_pad_pins[0]->getAnalogValue(),
                   (float(microbit_analog_pad_pins[2]->getAnalogValue()) / 1024.0), height_bar_p2);
            printf("\n");

            ssd->fill(0x00);
            ssd->drawRectangle(30, 14, 40, 100, false, 0xFF);
            // ssd->drawRectangle(57, 14, 67, 100, false, 0xFF);
            ssd->drawRectangle(84, 14, 94, 100, false, 0xFF);

            ssd->drawRectangle(30, 100 - height_bar_p0, 40, 100, true, 0xFF);
            // ssd->drawRectangle(57, 100 - height_bar_p1, 67, 100, true, 0xFF);
            ssd->drawRectangle(84, 100 - height_bar_p2, 94, 100, true, 0xFF);

            ssd->drawText("P0", 30, 103, 0xFF);
            // ssd->drawText("P1", 57, 103, 0xFF);
            ssd->drawText("P2", 84, 103, 0xFF);
            ssd->show();

            start_timeout = getCurrentMillis();
        }

        fiber_sleep(1);
    }
}

void show_jacdac()
{
    uint32_t timeout     = 0;
    uint8_t data_to_send = 0;
    char buff[3]         = {0};
    bool is_tx_mode      = true;
    jacdac->setMode(SingleWireMode::SingleWireTx);

    timeout = getCurrentMillis();

    while (1) {
        if (click_button(btnMenu)) {
            break;
        }

        if (click_button(btnA)) {
            if (is_tx_mode) {
                is_tx_mode = false;
                jacdac->setMode(SingleWireMode::SingleWireRx);
                memset(buff, 'x', 3);
            }
            else {
                is_tx_mode = true;
                jacdac->setMode(SingleWireMode::SingleWireTx);
                data_to_send = 0;
            }

            timeout = getCurrentMillis();
        }

        if (is_tx_mode) {
            if (getCurrentMillis() - timeout > 1000) {
                data_to_send++;
                timeout = getCurrentMillis();
            }

            sprintf(buff, "%03u", data_to_send);

            ssd->fill(0x00);
            ssd->drawText("Mode: Tx", 40, 24, 0xFF);
            ssd->drawText("Send value:", 34, 51, 0xFF);
            ssd->drawText(buff, 56, 62, 0xFF);
            ssd->drawText("A: Change to Rx", 19, 95, 0xFF);
            ssd->show();

            jacdac->putc(data_to_send);
        }
        else {
            uint8_t rcv = jacdac->getc();

            if (rcv != DEVICE_NO_DATA) {
                sprintf(buff, "%03u", rcv);
            }

            ssd->fill(0x00);
            ssd->drawText("Mode: Rx", 40, 24, 0xFF);
            ssd->drawText("Read value:", 34, 51, 0xFF);
            ssd->drawText(buff, 56, 62, 0xFF);
            ssd->drawText("A: Change to Tx", 19, 95, 0xFF);
            ssd->show();
        }

        fiber_sleep(100);
    }
}

void show_flash()
{
    uint32_t start_timeout_screen = 0;
    uint32_t start_timeout_data   = 0;
    uint16_t angle_offset         = 0;
    char buffer[32];

    ssd->fill(0x00);
    ssd->drawText("Log. distance data", 11, 40, 0xFF);
    ssd->drawText("Unplug & replug", 20, 81, 0xFF);
    ssd->drawText("the board", 35, 91, 0xFF);
    ssd->drawText("to get the file", 20, 102, 0xFF);

    ssd->drawArc(62, 63, 10, angle_offset, angle_offset + 90, 0xFF);

    ssd->show();

