letssteam/codal-stm32-STEAM32_WB55RG/samples/Demo/demo_sample.cpp
    flash->clearFlash();
    fiber_sleep(1000);
    flash->setFilename("DEMO", "CSV");
    flash->writeString("time;distance\n");

    while (1) {
        if (click_button(btnMenu)) {
            break;
        }

        if (getCurrentMillis() - start_timeout_data >= 1000) {
            sprintf(buffer, "%u;%u\n", getCurrentMillis(), tof->getDistance());
            flash->writeString(buffer);

            start_timeout_data = getCurrentMillis();
        }

        if (getCurrentMillis() - start_timeout_screen >= 50) {
            ssd->drawRectangle(51, 52, 73, 73, true, 0x00);
            ssd->drawArc(62, 63, 10, angle_offset, angle_offset + 90, 0xFF);
            ssd->show();

            angle_offset += 18;

            if (angle_offset >= 360) {
                angle_offset = 0;
            }
            start_timeout_screen = getCurrentMillis();
        }

        fiber_sleep(1);
    }
}

void show_qwic()
{
    uint32_t timeout_send = 0;

    ssd->fill(0x00);
    ssd->drawText("QWIIC", 48, 17, 0xFF);
    ssd->drawText("Send data 0x55", 21, 53, 0xFF);
    ssd->drawText("on address 0x96", 18, 64, 0xFF);
    ssd->drawText("every seconds.", 22, 75, 0xFF);
    ssd->show();

    while (1) {
        if (click_button(btnMenu)) {
            break;
        }

        if (getCurrentMillis() - timeout_send >= 1000) {
            i2c_qwiic->beginTransmission(0xAA);
            i2c_qwiic->write(0x96);
            i2c_qwiic->endTransmission();

            timeout_send = getCurrentMillis();
        }

        fiber_sleep(1);
    }
}

void Demo_main(codal::STM32STEAM32_WB55RG& steam32)
{
    i2c_qwiic = &steam32.i2c3;
    spi       = &steam32.spi1;
    cs        = &steam32.io.PD_0;
    dc        = &steam32.io.PB_4;
    rst       = &steam32.io.PA_12;
    ssd       = new SSD1327_SPI(*spi, *cs, *dc, *rst, 128, 128);
    btnMenu   = &steam32.io.PA_0;
    btnA      = &steam32.io.PA_7;
    btnB      = &steam32.io.PA_8;
    buzzer    = &steam32.io.PA_11;

    led_red   = &steam32.io.PC_12;
    led_green = &steam32.io.PC_11;
    led_blue  = &steam32.io.PC_10;

    buzzer->setAnalogValue(0);

    steam32.serial.init(115200);
    steam32.sleep(500);

    printf("Init peripherals !\r\n");

    ssd->init();
    ssd->fill(0x00);
    ssd->drawText("Initialization...", 15, 60, 0xFF);
    ssd->show();

    battery = new BQ27441(&steam32.i2c1);
    mcp     = new MCP23009E(steam32.i2c1, 0x40, steam32.io.PB_1, steam32.io.PB_0);
    hts     = new HTS221(&steam32.i2c1, 0xBE);
    pres    = new WSEN_PADS(steam32.i2c1, 0xBA);
    apds    = new APDS9960(steam32.i2c1, 0x72);
    tof     = new VL53L1X(&steam32.i2c1);
    ism     = new ISM330DL(&steam32.i2c1);
    lis     = new LIS2MDL(&steam32.i2c1);
    sai     = new STM32SAI(&steam32.io.PA_10, &steam32.io.PA_3, GPIO_AF3_SAI1, AUDIO_BUFFER);
    jacdac  = new STM32SingleWireSerial(steam32.io.PB_6);
    rtc     = new STM32RTC();
    flash   = new DaplinkFlash(steam32.i2c1);

    battery->init();

    mcp->setup(MCP_GPIO_1, MCP_DIR::INPUT, MCP_PULLUP::PULLUP);
    mcp->setup(MCP_GPIO_2, MCP_DIR::INPUT, MCP_PULLUP::PULLUP);
    mcp->setup(MCP_GPIO_3, MCP_DIR::INPUT, MCP_PULLUP::PULLUP);
    mcp->setup(MCP_GPIO_4, MCP_DIR::INPUT, MCP_PULLUP::PULLUP);
    mcp->setup(MCP_GP_RIGHT, MCP_DIR::INPUT);
    mcp->setup(MCP_GP_BOTTOM, MCP_DIR::INPUT);
    mcp->setup(MCP_GP_LEFT, MCP_DIR::INPUT);
    mcp->setup(MCP_GP_UP, MCP_DIR::INPUT);

    hts->init();
    hts->setOutputRate(codal::HTS221_OUTPUT_RATE::RATE_7HZ);

    pres->init();

    tof->init();

    ism->init();
    ism->setAccelerometerODR(ISM_ODR::F_1_66_KHZ);
    ism->setGyroscopeODR(ISM_ODR::F_208_HZ);

    lis->init();
    lis->setODR(LIS2_ODR::F_50_HZ);
    lis->setLowPassFilter(true);

    apds->init();

    if (!sai->init()) {
        printf("Failed to init SAI\r\n");
    }
    sai->onReceiveData(micro_on_data);

    jacdac->init(115200);
    jacdac->setMode(SingleWireMode::SingleWireTx);

    rtc->init();

    microbit_pins[0]  = &steam32.io.PA_2;
    microbit_pins[1]  = &steam32.io.PC_4;
    microbit_pins[2]  = &steam32.io.PA_4;
    microbit_pins[3]  = &steam32.io.PA_7;
    microbit_pins[4]  = &steam32.io.PC_3;
    microbit_pins[5]  = &steam32.io.PA_9;
    microbit_pins[6]  = &steam32.io.PA_5;
    microbit_pins[7]  = &steam32.io.PA_15;
    microbit_pins[8]  = &steam32.io.PC_2;
    microbit_pins[9]  = &steam32.io.PA_6;
    microbit_pins[10] = &steam32.io.PA_8;
    microbit_pins[11] = &steam32.io.PC_6;
    microbit_pins[12] = &steam32.io.PC_5;
    microbit_pins[13] = &steam32.io.PB_13;
    microbit_pins[14] = &steam32.io.PB_14;
    microbit_pins[15] = &steam32.io.PB_15;
    microbit_pins[16] = &steam32.io.PE_4;
    microbit_pins[17] = &steam32.io.PC_0;
    microbit_pins[18] = &steam32.io.PC_1;

    microbit_pwm_pins[0] = &steam32.io.PA_9;
    microbit_pwm_pins[1] = &steam32.io.PA_6;
    microbit_pwm_pins[2] = &steam32.io.PA_8;

    microbit_analog_pad_pins[0] = &steam32.io.PC_4;
    microbit_analog_pad_pins[1] = &steam32.io.PA_5;
    microbit_analog_pad_pins[2] = &steam32.io.PC_5;

    steam32.sleep(500);

    ssd->fill(0x00);
    ssd->drawText("Hello STeaMi !", 20, 60, 0xFF);
    ssd->show();
    printf("Hello STeaMi !\r\n");
    steam32.sleep(1500);

    vector<MenuEntry> mainMenuEntries = {{"Temp & Hum", []() -> void { show_temp_hum(); }},
                                         {"Pressure", []() -> void { show_pressure(); }},
                                         {"Time Of Flight", []() -> void { show_tof(); }},
                                         {"Acc / Gyro / Magn", []() -> void { show_acc_gyro_magn(); }},
                                         {"Color Sensor", []() -> void { show_optical_sensor(); }},
                                         {"Microphone", []() -> void { show_microphone(); }},
                                         {"RTC", []() -> void { show_rtc(); }},
                                         {"Buzzer", []() -> void { show_buzzer(); }},
                                         {"Buttons", []() -> void { show_button(); }},
                                         {"LEDs", []() -> void { show_rgb(); }},
                                         {"Screen", []() -> void { show_screen(); }},
                                         {"Battery", []() -> void { show_battery(); }},
                                         {"Pads \"tete\"", []() -> void { show_pads(); }},
                                         {"Pads micro:bit", []() -> void { show_microbit(); }},
                                         {"PWM micro:bit", []() -> void { show_pwm_microbit(); }},
                                         {"Analog micro:bit", []() -> void { show_analog_microbit(); }},
                                         {"jacdac (SWS)", []() -> void { show_jacdac(); }},
                                         {"DapLink Flash", []() -> void { show_flash(); }},
                                         {"QWIIC", []() -> void { show_qwic(); }}};
    mainMenu                          = new ScreenMenu(*ssd, mainMenuEntries);

    while (1) {
        show_main_menu();
    }
}